app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
  $(function() {
    $(".js-more").on("click", function() {
      var id = $(this).data("id");
      $.get("/products/" + id + ".json", function(data) {
        var product = data;
        var inventoryText = "<strong>Available</strong>";
        if(product["inventory"] === 0){
          inventoryText = "<strong>Sold Out</strong>";
        }
        var descriptionText = "<p>" + product["description"] + "</p><p>" + inventoryText + "</p>";
        $("#product-" + id).html(descriptionText);
        $(product.orders).each(function(index){
          $(".product-block-"+id).append("<p>"+ product.orders[index]["id"] + "</p>")
          $(".product-block-"+id).append("<p>"+ product.orders[index]["created_at"] + "</p>")

        })
        // $(".product-block-"+id).append("<p>"+ product.orders + "</p>")
      });
    });
  });
---
SELECT "products".* FROM "products"